Revit 2027 API
BuiltInFailures.SketchFailures.RebarEmptySketch Property
 Rebar Sketch is empty. Can't create Rebar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarEmptySketch { get; }
Public Shared ReadOnly Property RebarEmptySketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarEmptySketch {
	FailureDefinitionId^ get ();
}
static member RebarEmptySketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace